Revit 2027 API
ExtElemChangeBeamSectionRegistry.Unregister Method
 Unregisters IExtElemChangeBeamSection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void Unregister()
Public Shared Sub Unregister
public:
static void Unregister()
static member Unregister : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  There is no valid Connections Provider registered.
See Also
Reference
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace